<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
	<TITLE>Janosch's Homepage - stereogramm howto (02) (deutsch)</TITLE>
</HEAD>
<BODY bgcolor=#000000 link=#0050a0 alink=#0010e0 vlink=#102070>
<font face="Courier">
	<center>
	<table cellpadding=11 cellspacing=0 border=0>
	 <tr>
	  <td bgcolor=#afdfdf align=right width=800 height=64>
		<font size=4 color=#300000 face="Courier"><b>stereogramm howto (02) (german)</b></font>
	  </td>
	  <td bgcolor=#003080 align=center valign=middle colspan=1 width=64 height=64>
		<font size=4 face="Courier"><b><a href="index.html">x</a></b></font>
	  </td>
	 </tr>
	 <tr>
	  <td bgcolor=#ffffff colspan=2>
		<center>
		<table width=790 cellpadding=10 cols=1>
		<tr>
		<td width=250 valign=top rowspan=1>
		<font color=#000001 face="Courier">
			<p align=justify>Bevor wir mit dem Design eigener Stereogramme beginnen, sollten wir uns vorher erst einmal Gedanken dar&uuml;ber machen, wie man ein Stereogramm eigentlich betrachtet. Es gibt sehr viele Wege, manche schwerer, manche leichter, doch das h&auml;ngt vom Betrachter ab. Ein erfahrener ist hier klar im Vorteil, denn das <i>Sehen</i> von Stereogrammen mu&szlig; gelernt, also ge&uuml;bt sein. Ich habe die Erfahrung gemacht, da&szlig; jeder damit seine ganz eigene Erfahrung macht. Ich m&ouml;chte hier einige Hinweise und Tips geben, die diesen Lernproze&szlig; erleichtern k&ouml;nnten. Erfolgsrezepte gibt es leider keine. Die eine lernt es schneller, der andere lernt es langsamer, wie es bei Menschen eben von ihrer Natur aus so &uuml;blich ist. Ich treffe auch immer wieder auf Leute, die behaupten, sie k&ouml;nnten sowas nicht sehen. So lange sie zwei funktionsf&auml;hige Augen besitzen und mit ihnen r&auml;umlich die Realit&auml;t zu erfassen in der Lage sind, dann k&ouml;nnen auch sie in die magischen Tiefen dieser Bilder eindringen, ob sie wollen oder nicht. Auch DU kannst es lernen, und Sie, Sie und Sie! :)</p>
			<p align=justify>Erst mal einige Grundregeln.
			<ul>
				<li>Regel Nr.1: geduldig sein und Ruhe bewahren! :)
				<li>Regel Nr.2: das Absetzen von Brillen hilft normalerweise nichts, sorry.
				<li>Regel Nr.3: auch der neugierige Blick in die L&ouml;sung ist nicht wirklich hilfreich.
				<li>Regel Nr.4: wenn es mit dem einen nicht klappen will, dann erst mal ein anderes ausprobieren und es danach nochmal versuchen. Es gibt schwere und leichtere Stereogramme. Hier spielen viele Faktoren mit, dazu sp&auml;ter.
				<li>Regel Nr.5: ich habe leider keine Ahnung, ob sich der Genu&szlig; von enthemmend wirkenden Drogen (Alkohol usw.) tats&auml;chlich positiv auswirkt - aber denkbar w&auml;re es. Das Gegenargument ist allerdings, da&szlig; das Betrachten anfangs enorme Konzentation erfordert.
                        </ul>
			<p align=justify>Die wohl bekannteste und beliebteste, aber meiner Meinung nach nicht die effektivste Methode, ist das <i>Nasenprinzip</i>. Man halte das Stereogramm direkt vor die Nase - so da&szlig; ausgeschlossen ist, es direkt zu betrachten, also zu fokusieren. Das ist auch das Ziel dieser &Uuml;bung: man braucht den absoluten <i>Durchblick</i> durch ein Stereogramm, um in seine Tiefe eintauchen zu k&ouml;nnen. Nun entferne man langsam das Stereogramm, ohne es dabei allerdings zu fokusieren. Falls man ihm trotz meiner Worte nicht widerstehen kann und es s&uuml;ndhaft besch&auml;mt direkt ansieht, was die ersten zehn Versuche unweigerlich passieren wird, dann mu&stlig; man sich nicht bei mir daf&uuml;r pers&ouml;nlich entschuldigen - aber es mu&szlig; nochmal von vorne bei der Nase begonnen werden. In einer Entfernung des Stereogramms von den Augen von vielleicht 20-50cm sollte langsam ein Tiefeneindruck entstehen. Dann geht es pl&ouml;tzlich sehr schnell. Entweder, man beh&auml;lt trotz &uuml;berw&auml;ltigendenden Emotionen die Konzentration, um dem direkten Blick auf das Bild zu widerstehen und man taucht weiter in die Tiefe und die Details ein, oder man darf schon wieder von vorne bei der Nase beginnen. F&uuml;r Computerfreaks ist diese Methode nat&uuml;rlich auch anwendbar. Sie sollten allerdings sich vom Bildschirm langsam entfernen und nicht umgekehrt,  denn das Stereogramm sollte so ruhig wie m&ouml;glich vor den Augen gehalten werden.
			<p align=justify>Als eine Variante des gerade beschriebenen <i>Nasenprinzips</i> kann die folgende Methode angesehen werden. Man fixiere einen relativ weit entfernten Punkt. Das hei&szlig;t nicht explizit, da&szlig; man in die unendliche Ferne des Weltalls starren mu&szlig; - es gen&uuml;gt normalerweise eine gegen&uuml;berliegende Wand. Nun nehme man das Stereogramm, ohne es direkt anzusehen und man bewege es langsam, etwa 30-50cm von der Nase entfernt, in den hoffentlich noch starren Blick. Hier tritt der Tiefeneindruck sofort auf - wenn er auftritt. Ansonsten gilt: &uuml;ben, &uuml;ben und nochmals &uuml;ben - oder eine andere Methode ausprobieren oder vielleicht erst mal ein anderes Stereogramm w&auml;hlen. Zugegeben, diese Methode ist nicht mal auf Besitzer von Plasmabildschirmen anwendbar. Aber wof&uuml;r wurden sonst die Laptops erfunden!? :)
			<p align=justify>Die vorerst letzte hier beschriebene Methode ist die <i>Reflexionsmethode</i>. Sie ist auf Hochglanzpapier, hinter Glass oder auf dem Monitor anwendbar, sofern die verwendete Lichtquelle hell genug ist, um die Anti-Reflexions-Beschichtung zu &uuml;berwinden. Man bedient sich hierbei einer Reflexion, meist, wie gerade eben angedeutet, der einer Lichquelle. Diese Reflexion sollte r&auml;umlich erscheinen. Das bedeutet, da&szlig; sich der reflektierte Lichtpunkt f&ouml;rmlich im Stereogramm befindet. Jetzt ist es ganz einfach und es geht auch superschnell: man betrachte einfach diese Reflexion im Bild und <i>schwups</i> sollte das Stereogramm erscheinen. Wenn das nicht nach mehreren intensiven Versuchen gelingt, versuche man eine der vorher beschriebenen Methoden.
		</font>
		</td>
		</tr>
		</table>
		<table width=790>
		<tr>
		<td align=right>
		<font color=#000000 face="Courier">
			<a href="./index.html">...to be continued</a><br>&nbsp;
		</font>
		</td>
		</tr>
		<tr>
		<td align=right>
		<font color=#000000 face="Courier">
			&copy; 2000 by <a href="mailto:fabian.3d@januszewski.de">Fabian Januszewski</a><br>&nbsp;<br>&nbsp;
		</font>
		</td>
		</tr>
		</table>
		</center>
	  </td>
	 </tr>
	</table>
	</center>
</font>
</BODY>
</HTML>
